<h1>Practical-10-a-Working with Pandas

<h5>Name : Tarpara Kaushal
<h5>Roll no : MA060

<h3>1.Insert more 10 rows into the dataframe.

In [61]:
import pandas as pd

df = pd.read_csv("practical-10-a-empdata.csv")

print(df)

new_rows_data = {
    'empid': [1007, 1008, 1009, 1010, 1011, 1012, 1013, 1014, 1015, 1016],
    'ename': ['Suresh Kumar', 'Rajesh Sharma', 'Priya Singh', 'Mohan Reddy', 'Neha Verma', 'Amit Patel', 'Shweta Gupta', 'Sandeep Yadav', 'Pooja Sharma', 'Rajendra Kumar'],
    'sal': [14500.75, 21000.0, 17500.25, 19800.5, 13200.0, 18999.99, 15750.0, 20500.0, 12000.0, 22000.5],
    'doj': ['04-15-2003', '06-30-2004', '09-20-2005', '02-14-2006', '07-05-2007', '11-11-2008', '03-25-2009', '08-10-2010', '05-02-2011', '12-18-2012']
}

new_rows_df = pd.DataFrame(new_rows_data)
df = df.append(new_rows_df,ignore_index=True)
 
print(df)

   empid           ename       sal         doj
0   1001      Ganesh Rao  10000.00  10-10-2000
1   1002      Anil Kumar  23000.50   3-20-2002
2   1003    Gaurav Gupta  18000.53  03-03-2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000
5   1006       Anant Nag   9999.99  09-09-1999
    empid           ename       sal         doj
0    1001      Ganesh Rao  10000.00  10-10-2000
1    1002      Anil Kumar  23000.50   3-20-2002
2    1003    Gaurav Gupta  18000.53  03-03-2002
3    1004    Hema Chandra  16500.50  09-10-2000
4    1005  Laxmi Prasanna  12000.75  10-08-2000
5    1006       Anant Nag   9999.99  09-09-1999
6    1007    Suresh Kumar  14500.75  04-15-2003
7    1008   Rajesh Sharma  21000.00  06-30-2004
8    1009     Priya Singh  17500.25  09-20-2005
9    1010     Mohan Reddy  19800.50  02-14-2006
10   1011      Neha Verma  13200.00  07-05-2007
11   1012      Amit Patel  18999.99  11-11-2008
12   1013    Shweta Gupta  15750.00  03-25-2009
13   1014   Sandeep Yadav  20500.00  08-10-2010
14   1015    Pooja Sharma  12000.00  05-02-2011
15   1016  Rajendra Kumar  22000.50  12-18-2012

C:\Users\kaush\AppData\Local\Temp\ipykernel_11884\3557196510.py:15: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_rows_df,ignore_index=True)

<h3>2. Add new column 'gender".

In [62]:
gender_values = ['Male', 'Male', 'Male', 'Female', 'Female', 'Male', 'Male', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Male']
df['gender'] = gender_values
print(df)

    empid           ename       sal         doj  gender
0    1001      Ganesh Rao  10000.00  10-10-2000    Male
1    1002      Anil Kumar  23000.50   3-20-2002    Male
2    1003    Gaurav Gupta  18000.53  03-03-2002    Male
3    1004    Hema Chandra  16500.50  09-10-2000  Female
4    1005  Laxmi Prasanna  12000.75  10-08-2000  Female
5    1006       Anant Nag   9999.99  09-09-1999    Male
6    1007    Suresh Kumar  14500.75  04-15-2003    Male
7    1008   Rajesh Sharma  21000.00  06-30-2004    Male
8    1009     Priya Singh  17500.25  09-20-2005  Female
9    1010     Mohan Reddy  19800.50  02-14-2006    Male
10   1011      Neha Verma  13200.00  07-05-2007  Female
11   1012      Amit Patel  18999.99  11-11-2008    Male
12   1013    Shweta Gupta  15750.00  03-25-2009  Female
13   1014   Sandeep Yadav  20500.00  08-10-2010    Male
14   1015    Pooja Sharma  12000.00  05-02-2011  Female
15   1016  Rajendra Kumar  22000.50  12-18-2012    Male

<h3>3. Print salary of Ganesh Rao.

In [63]:
print("Salary of Ganesh Rao:",df[df['ename'] == 'Ganesh Rao']['sal'].values[0])

Salary of Ganesh Rao: 10000.0

<h3>4. Print joining date and id of Laxmi Prasanna.

In [64]:
laxmi_prasanna_info = df[df['ename'] == 'Laxmi Prasanna'][['doj', 'empid']]

print("Joining Date and Employee ID of Laxmi Prasanna:")
print(laxmi_prasanna_info)

Joining Date and Employee ID of Laxmi Prasanna:
          doj  empid
4  10-08-2000   1005

<h3>5. Print average salary.

In [65]:
average_salary = df['sal'].mean()

print("Average Salary:", average_salary)

Average Salary: 16547.14125

<h3>6. Add new column "annual-salary".

In [66]:
df['annual-salary'] = df['sal'] * 12

print(df)

    empid           ename       sal         doj  gender  annual-salary
0    1001      Ganesh Rao  10000.00  10-10-2000    Male      120000.00
1    1002      Anil Kumar  23000.50   3-20-2002    Male      276006.00
2    1003    Gaurav Gupta  18000.53  03-03-2002    Male      216006.36
3    1004    Hema Chandra  16500.50  09-10-2000  Female      198006.00
4    1005  Laxmi Prasanna  12000.75  10-08-2000  Female      144009.00
5    1006       Anant Nag   9999.99  09-09-1999    Male      119999.88
6    1007    Suresh Kumar  14500.75  04-15-2003    Male      174009.00
7    1008   Rajesh Sharma  21000.00  06-30-2004    Male      252000.00
8    1009     Priya Singh  17500.25  09-20-2005  Female      210003.00
9    1010     Mohan Reddy  19800.50  02-14-2006    Male      237606.00
10   1011      Neha Verma  13200.00  07-05-2007  Female      158400.00
11   1012      Amit Patel  18999.99  11-11-2008    Male      227999.88
12   1013    Shweta Gupta  15750.00  03-25-2009  Female      189000.00
13   1014   Sandeep Yadav  20500.00  08-10-2010    Male      246000.00
14   1015    Pooja Sharma  12000.00  05-02-2011  Female      144000.00
15   1016  Rajendra Kumar  22000.50  12-18-2012    Male      264006.00

<h3>7. List female employees who are earning above average salary.

In [67]:
average_salary = df['sal'].mean()

female_above_average = df[(df['gender'] == 'Female') & (df['sal'] > average_salary)]
print(f"Female employees earning above average salary ({average_salary}):")
print(female_above_average)

Female employees earning above average salary (16547.14125):
   empid        ename       sal         doj  gender  annual-salary
8   1009  Priya Singh  17500.25  09-20-2005  Female       210003.0

<h3>8. List most recently joined three employees.

In [68]:
df_sorted = df.sort_values(by='doj', ascending=False)


recently_joined_employees = df_sorted.head(3)

print("Most recently joined three employees:")
print(recently_joined_employees)

Most recently joined three employees:
    empid           ename       sal         doj gender  annual-salary
1    1002      Anil Kumar  23000.50   3-20-2002   Male      276006.00
15   1016  Rajendra Kumar  22000.50  12-18-2012   Male      264006.00
11   1012      Amit Patel  18999.99  11-11-2008   Male      227999.88

<h3>9. Convert all column names to InitCap case.

In [69]:
def initcap_column_name(column_name):
    return column_name.title()

initcap_columns = [initcap_column_name(col) for col in df.columns]
df.columns = initcap_columns

print(df)

    Empid           Ename       Sal         Doj  Gender  Annual-Salary
0    1001      Ganesh Rao  10000.00  10-10-2000    Male      120000.00
1    1002      Anil Kumar  23000.50   3-20-2002    Male      276006.00
2    1003    Gaurav Gupta  18000.53  03-03-2002    Male      216006.36
3    1004    Hema Chandra  16500.50  09-10-2000  Female      198006.00
4    1005  Laxmi Prasanna  12000.75  10-08-2000  Female      144009.00
5    1006       Anant Nag   9999.99  09-09-1999    Male      119999.88
6    1007    Suresh Kumar  14500.75  04-15-2003    Male      174009.00
7    1008   Rajesh Sharma  21000.00  06-30-2004    Male      252000.00
8    1009     Priya Singh  17500.25  09-20-2005  Female      210003.00
9    1010     Mohan Reddy  19800.50  02-14-2006    Male      237606.00
10   1011      Neha Verma  13200.00  07-05-2007  Female      158400.00
11   1012      Amit Patel  18999.99  11-11-2008    Male      227999.88
12   1013    Shweta Gupta  15750.00  03-25-2009  Female      189000.00
13   1014   Sandeep Yadav  20500.00  08-10-2010    Male      246000.00
14   1015    Pooja Sharma  12000.00  05-02-2011  Female      144000.00
15   1016  Rajendra Kumar  22000.50  12-18-2012    Male      264006.00

<h3>10. Count male employees who are not earning below average salary.

In [70]:
avg_sal = df['Sal'].mean()

male_above_avg = df[(df['Gender'] == 'Male') & (df['Sal'] >= avg_sal)]

count_male_above_avg = len(male_above_avg)

print(f"Count of male employees earning above or equal to average salary ({avg_sal}): {count_male_above_avg}")

Count of male employees earning above or equal to average salary (16547.14125): 7

<h3>11. Calculate and store bonus in a new column 'Bonus'. It should be 10% and 7.5% of 'Sal' for male and female employees respectively.

In [71]:
def calculate_bonus(row):
    if row['Gender'] == 'Male':
        return row['Sal'] * 0.10
    elif row['Gender'] == 'Female':
        return row['Sal'] * 0.075
    else:
        return 0

df['Bonus'] = df.apply(calculate_bonus, axis=1)

print(df)

    Empid           Ename       Sal         Doj  Gender  Annual-Salary  \
0    1001      Ganesh Rao  10000.00  10-10-2000    Male      120000.00
1    1002      Anil Kumar  23000.50   3-20-2002    Male      276006.00
2    1003    Gaurav Gupta  18000.53  03-03-2002    Male      216006.36
3    1004    Hema Chandra  16500.50  09-10-2000  Female      198006.00
4    1005  Laxmi Prasanna  12000.75  10-08-2000  Female      144009.00
5    1006       Anant Nag   9999.99  09-09-1999    Male      119999.88
6    1007    Suresh Kumar  14500.75  04-15-2003    Male      174009.00
7    1008   Rajesh Sharma  21000.00  06-30-2004    Male      252000.00
8    1009     Priya Singh  17500.25  09-20-2005  Female      210003.00
9    1010     Mohan Reddy  19800.50  02-14-2006    Male      237606.00
10   1011      Neha Verma  13200.00  07-05-2007  Female      158400.00
11   1012      Amit Patel  18999.99  11-11-2008    Male      227999.88
12   1013    Shweta Gupta  15750.00  03-25-2009  Female      189000.00
13   1014   Sandeep Yadav  20500.00  08-10-2010    Male      246000.00
14   1015    Pooja Sharma  12000.00  05-02-2011  Female      144000.00
15   1016  Rajendra Kumar  22000.50  12-18-2012    Male      264006.00

         Bonus
0   1000.00000
1   2300.05000
2   1800.05300
3   1237.53750
4    900.05625
5    999.99900
6   1450.07500
7   2100.00000
8   1312.51875
9   1980.05000
10   990.00000
11  1899.99900
12  1181.25000
13  2050.00000
14   900.00000
15  2200.05000

<h3>12. Delete row having the least salary.

In [72]:
index_of_least_salary = df['Sal'].idxmin()


df = df.drop(index_of_least_salary)


df.reset_index(drop=True, inplace=True)


print(df)

    Empid           Ename       Sal         Doj  Gender  Annual-Salary  \
0    1001      Ganesh Rao  10000.00  10-10-2000    Male      120000.00
1    1002      Anil Kumar  23000.50   3-20-2002    Male      276006.00
2    1003    Gaurav Gupta  18000.53  03-03-2002    Male      216006.36
3    1004    Hema Chandra  16500.50  09-10-2000  Female      198006.00
4    1005  Laxmi Prasanna  12000.75  10-08-2000  Female      144009.00
5    1007    Suresh Kumar  14500.75  04-15-2003    Male      174009.00
6    1008   Rajesh Sharma  21000.00  06-30-2004    Male      252000.00
7    1009     Priya Singh  17500.25  09-20-2005  Female      210003.00
8    1010     Mohan Reddy  19800.50  02-14-2006    Male      237606.00
9    1011      Neha Verma  13200.00  07-05-2007  Female      158400.00
10   1012      Amit Patel  18999.99  11-11-2008    Male      227999.88
11   1013    Shweta Gupta  15750.00  03-25-2009  Female      189000.00
12   1014   Sandeep Yadav  20500.00  08-10-2010    Male      246000.00
13   1015    Pooja Sharma  12000.00  05-02-2011  Female      144000.00
14   1016  Rajendra Kumar  22000.50  12-18-2012    Male      264006.00

         Bonus
0   1000.00000
1   2300.05000
2   1800.05300
3   1237.53750
4    900.05625
5   1450.07500
6   2100.00000
7   1312.51875
8   1980.05000
9    990.00000
10  1899.99900
11  1181.25000
12  2050.00000
13   900.00000
14  2200.05000

<h3>13. Delete salary of Laxmi and Gaurav.

In [73]:
df.loc[df['Ename'].isin(['Laxmi Prasanna', 'Gaurav Gupta']), 'Sal'] = None
print(df)

    Empid           Ename       Sal         Doj  Gender  Annual-Salary  \
0    1001      Ganesh Rao  10000.00  10-10-2000    Male      120000.00
1    1002      Anil Kumar  23000.50   3-20-2002    Male      276006.00
2    1003    Gaurav Gupta       NaN  03-03-2002    Male      216006.36
3    1004    Hema Chandra  16500.50  09-10-2000  Female      198006.00
4    1005  Laxmi Prasanna       NaN  10-08-2000  Female      144009.00
5    1007    Suresh Kumar  14500.75  04-15-2003    Male      174009.00
6    1008   Rajesh Sharma  21000.00  06-30-2004    Male      252000.00
7    1009     Priya Singh  17500.25  09-20-2005  Female      210003.00
8    1010     Mohan Reddy  19800.50  02-14-2006    Male      237606.00
9    1011      Neha Verma  13200.00  07-05-2007  Female      158400.00
10   1012      Amit Patel  18999.99  11-11-2008    Male      227999.88
11   1013    Shweta Gupta  15750.00  03-25-2009  Female      189000.00
12   1014   Sandeep Yadav  20500.00  08-10-2010    Male      246000.00
13   1015    Pooja Sharma  12000.00  05-02-2011  Female      144000.00
14   1016  Rajendra Kumar  22000.50  12-18-2012    Male      264006.00

         Bonus
0   1000.00000
1   2300.05000
2   1800.05300
3   1237.53750
4    900.05625
5   1450.07500
6   2100.00000
7   1312.51875
8   1980.05000
9    990.00000
10  1899.99900
11  1181.25000
12  2050.00000
13   900.00000
14  2200.05000

<h3>14. Set missing salary with the average salary.

In [74]:
average_salary = df['Sal'].mean()


df['Sal'].fillna(average_salary, inplace=True)

print(df)

    Empid           Ename           Sal         Doj  Gender  Annual-Salary  \
0    1001      Ganesh Rao  10000.000000  10-10-2000    Male      120000.00
1    1002      Anil Kumar  23000.500000   3-20-2002    Male      276006.00
2    1003    Gaurav Gupta  17288.691538  03-03-2002    Male      216006.36
3    1004    Hema Chandra  16500.500000  09-10-2000  Female      198006.00
4    1005  Laxmi Prasanna  17288.691538  10-08-2000  Female      144009.00
5    1007    Suresh Kumar  14500.750000  04-15-2003    Male      174009.00
6    1008   Rajesh Sharma  21000.000000  06-30-2004    Male      252000.00
7    1009     Priya Singh  17500.250000  09-20-2005  Female      210003.00
8    1010     Mohan Reddy  19800.500000  02-14-2006    Male      237606.00
9    1011      Neha Verma  13200.000000  07-05-2007  Female      158400.00
10   1012      Amit Patel  18999.990000  11-11-2008    Male      227999.88
11   1013    Shweta Gupta  15750.000000  03-25-2009  Female      189000.00
12   1014   Sandeep Yadav  20500.000000  08-10-2010    Male      246000.00
13   1015    Pooja Sharma  12000.000000  05-02-2011  Female      144000.00
14   1016  Rajendra Kumar  22000.500000  12-18-2012    Male      264006.00

         Bonus
0   1000.00000
1   2300.05000
2   1800.05300
3   1237.53750
4    900.05625
5   1450.07500
6   2100.00000
7   1312.51875
8   1980.05000
9    990.00000
10  1899.99900
11  1181.25000
12  2050.00000
13   900.00000
14  2200.05000

<h3>15. Convert all employee names to upper case.

In [75]:
df['Ename'] = df['Ename'].str.upper()

print(df)

    Empid           Ename           Sal         Doj  Gender  Annual-Salary  \
0    1001      GANESH RAO  10000.000000  10-10-2000    Male      120000.00
1    1002      ANIL KUMAR  23000.500000   3-20-2002    Male      276006.00
2    1003    GAURAV GUPTA  17288.691538  03-03-2002    Male      216006.36
3    1004    HEMA CHANDRA  16500.500000  09-10-2000  Female      198006.00
4    1005  LAXMI PRASANNA  17288.691538  10-08-2000  Female      144009.00
5    1007    SURESH KUMAR  14500.750000  04-15-2003    Male      174009.00
6    1008   RAJESH SHARMA  21000.000000  06-30-2004    Male      252000.00
7    1009     PRIYA SINGH  17500.250000  09-20-2005  Female      210003.00
8    1010     MOHAN REDDY  19800.500000  02-14-2006    Male      237606.00
9    1011      NEHA VERMA  13200.000000  07-05-2007  Female      158400.00
10   1012      AMIT PATEL  18999.990000  11-11-2008    Male      227999.88
11   1013    SHWETA GUPTA  15750.000000  03-25-2009  Female      189000.00
12   1014   SANDEEP YADAV  20500.000000  08-10-2010    Male      246000.00
13   1015    POOJA SHARMA  12000.000000  05-02-2011  Female      144000.00
14   1016  RAJENDRA KUMAR  22000.500000  12-18-2012    Male      264006.00

         Bonus
0   1000.00000
1   2300.05000
2   1800.05300
3   1237.53750
4    900.05625
5   1450.07500
6   2100.00000
7   1312.51875
8   1980.05000
9    990.00000
10  1899.99900
11  1181.25000
12  2050.00000
13   900.00000
14  2200.05000

<h3>16. Count all employees who had joined before 01-01-2001.

In [79]:
df['Doj'] = pd.to_datetime(df['Doj'], format='%d-%m-%Y', errors='coerce')

count_employees_before_2001 = len(df[df['Doj'] <  pd.to_datetime('01-01-2001', format='%d-%m-%Y')])

print(f"Count of employees who joined before 01-01-2001: {count_employees_before_2001}")

Count of employees who joined before 01-01-2001: 3

<h3>17. Add a new column 'Department'. Possible values: "Systems", "Data Analytics", "Web Apps"

In [81]:
department_mapping = {
    'GANESH RAO': 'Systems',
    'ANIL KUMAR': 'Data Analytics',
    'GAURAV GUPTA': 'Web Apps',
    'HEMA CHANDRA': 'Systems',
    'LAXMI PRASANNA': 'Data Analytics',
    'ANANT NAG': 'Web Apps',
    'SURESH KUMAR': 'Systems',
    'RAJESH SHARMA': 'Data Analytics',
    'PRIYA SINGH': 'Web Apps',
    'MOHAN REDDY': 'Systems',
    'NEHA VERMA': 'Data Analytics',
    'AMIT PATEL': 'Web Apps',
    'SHWETA GUPTA': 'Systems',
    'SANDEEP YADAV': 'Data Analytics',
    'POOJA SHARMA': 'Web Apps',
    'RAJENDRA KUMAR': 'Systems'
}
df['Department'] = df['Ename'].str.upper().map(department_mapping)

print(df)

    Empid           Ename           Sal        Doj  Gender  Annual-Salary  \
0    1001      GANESH RAO  10000.000000 2000-10-10    Male      120000.00
1    1002      ANIL KUMAR  23000.500000        NaT    Male      276006.00
2    1003    GAURAV GUPTA  17288.691538 2002-03-03    Male      216006.36
3    1004    HEMA CHANDRA  16500.500000 2000-10-09  Female      198006.00
4    1005  LAXMI PRASANNA  17288.691538 2000-08-10  Female      144009.00
5    1007    SURESH KUMAR  14500.750000        NaT    Male      174009.00
6    1008   RAJESH SHARMA  21000.000000        NaT    Male      252000.00
7    1009     PRIYA SINGH  17500.250000        NaT  Female      210003.00
8    1010     MOHAN REDDY  19800.500000        NaT    Male      237606.00
9    1011      NEHA VERMA  13200.000000 2007-05-07  Female      158400.00
10   1012      AMIT PATEL  18999.990000 2008-11-11    Male      227999.88
11   1013    SHWETA GUPTA  15750.000000        NaT  Female      189000.00
12   1014   SANDEEP YADAV  20500.000000 2010-10-08    Male      246000.00
13   1015    POOJA SHARMA  12000.000000 2011-02-05  Female      144000.00
14   1016  RAJENDRA KUMAR  22000.500000        NaT    Male      264006.00

         Bonus      Department
0   1000.00000         Systems
1   2300.05000  Data Analytics
2   1800.05300        Web Apps
3   1237.53750         Systems
4    900.05625  Data Analytics
5   1450.07500         Systems
6   2100.00000  Data Analytics
7   1312.51875        Web Apps
8   1980.05000         Systems
9    990.00000  Data Analytics
10  1899.99900        Web Apps
11  1181.25000         Systems
12  2050.00000  Data Analytics
13   900.00000        Web Apps
14  2200.05000         Systems

<h3>18. Sort rows: department - salary - name viz.

In [82]:
df = df.sort_values(by=['Department', 'Sal', 'Ename'], ascending=[True, True, True])

df.reset_index(drop=True, inplace=True)

print(df)

    Empid           Ename           Sal        Doj  Gender  Annual-Salary  \
0    1011      NEHA VERMA  13200.000000 2007-05-07  Female      158400.00
1    1005  LAXMI PRASANNA  17288.691538 2000-08-10  Female      144009.00
2    1014   SANDEEP YADAV  20500.000000 2010-10-08    Male      246000.00
3    1008   RAJESH SHARMA  21000.000000        NaT    Male      252000.00
4    1002      ANIL KUMAR  23000.500000        NaT    Male      276006.00
5    1001      GANESH RAO  10000.000000 2000-10-10    Male      120000.00
6    1007    SURESH KUMAR  14500.750000        NaT    Male      174009.00
7    1013    SHWETA GUPTA  15750.000000        NaT  Female      189000.00
8    1004    HEMA CHANDRA  16500.500000 2000-10-09  Female      198006.00
9    1010     MOHAN REDDY  19800.500000        NaT    Male      237606.00
10   1016  RAJENDRA KUMAR  22000.500000        NaT    Male      264006.00
11   1015    POOJA SHARMA  12000.000000 2011-02-05  Female      144000.00
12   1003    GAURAV GUPTA  17288.691538 2002-03-03    Male      216006.36
13   1009     PRIYA SINGH  17500.250000        NaT  Female      210003.00
14   1012      AMIT PATEL  18999.990000 2008-11-11    Male      227999.88

         Bonus      Department
0    990.00000  Data Analytics
1    900.05625  Data Analytics
2   2050.00000  Data Analytics
3   2100.00000  Data Analytics
4   2300.05000  Data Analytics
5   1000.00000         Systems
6   1450.07500         Systems
7   1181.25000         Systems
8   1237.53750         Systems
9   1980.05000         Systems
10  2200.05000         Systems
11   900.00000        Web Apps
12  1800.05300        Web Apps
13  1312.51875        Web Apps
14  1899.99900        Web Apps

<h3>19. Find difference in count of employees ("System" and "Web Apps") earning below average salary.

In [83]:
average_salary = df['Sal'].mean()
systems_webapps_df = df[df['Department'].isin(['Systems', 'Web Apps'])]
below_average_salary_df = systems_webapps_df[systems_webapps_df['Sal'] < average_salary]
department_counts = below_average_salary_df['Department'].value_counts()
difference = department_counts.get('Systems', 0) - department_counts.get('Web Apps', 0)
print(f"Difference in count of employees ('Systems' - 'Web Apps') earning below average salary: {difference}")

Difference in count of employees ('Systems' - 'Web Apps') earning below average salary: 3

<h3>20. Increase salary of all females by 10% (of their existing salary) whose salary is below average salary.

In [84]:
average_salary = df['Sal'].mean()
female_below_average_df = df[(df['Gender'] == 'Female') & (df['Sal'] < average_salary)]
female_below_average_df['Sal'] = female_below_average_df['Sal'] * 1.10
df.update(female_below_average_df)
print(df)

     Empid           Ename           Sal        Doj  Gender  Annual-Salary  \
0   1011.0      NEHA VERMA  14520.000000 2007-05-07  Female      158400.00
1   1005.0  LAXMI PRASANNA  17288.691538 2000-08-10  Female      144009.00
2   1014.0   SANDEEP YADAV  20500.000000 2010-10-08    Male      246000.00
3   1008.0   RAJESH SHARMA  21000.000000        NaT    Male      252000.00
4   1002.0      ANIL KUMAR  23000.500000        NaT    Male      276006.00
5   1001.0      GANESH RAO  10000.000000 2000-10-10    Male      120000.00
6   1007.0    SURESH KUMAR  14500.750000        NaT    Male      174009.00
7   1013.0    SHWETA GUPTA  17325.000000        NaT  Female      189000.00
8   1004.0    HEMA CHANDRA  18150.550000 2000-10-09  Female      198006.00
9   1010.0     MOHAN REDDY  19800.500000        NaT    Male      237606.00
10  1016.0  RAJENDRA KUMAR  22000.500000        NaT    Male      264006.00
11  1015.0    POOJA SHARMA  13200.000000 2011-02-05  Female      144000.00
12  1003.0    GAURAV GUPTA  17288.691538 2002-03-03    Male      216006.36
13  1009.0     PRIYA SINGH  17500.250000        NaT  Female      210003.00
14  1012.0      AMIT PATEL  18999.990000 2008-11-11    Male      227999.88

         Bonus      Department
0    990.00000  Data Analytics
1    900.05625  Data Analytics
2   2050.00000  Data Analytics
3   2100.00000  Data Analytics
4   2300.05000  Data Analytics
5   1000.00000         Systems
6   1450.07500         Systems
7   1181.25000         Systems
8   1237.53750         Systems
9   1980.05000         Systems
10  2200.05000         Systems
11   900.00000        Web Apps
12  1800.05300        Web Apps
13  1312.51875        Web Apps
14  1899.99900        Web Apps

C:\Users\kaush\AppData\Local\Temp\ipykernel_11884\604157958.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  female_below_average_df['Sal'] = female_below_average_df['Sal'] * 1.10

<h3>21. Remove all "Data Analytics" department employees.

In [85]:
df = df[df['Department'] != 'Data Analytics']


df.reset_index(drop=True, inplace=True)


print(df)

    Empid           Ename           Sal        Doj  Gender  Annual-Salary  \
0  1001.0      GANESH RAO  10000.000000 2000-10-10    Male      120000.00
1  1007.0    SURESH KUMAR  14500.750000        NaT    Male      174009.00
2  1013.0    SHWETA GUPTA  17325.000000        NaT  Female      189000.00
3  1004.0    HEMA CHANDRA  18150.550000 2000-10-09  Female      198006.00
4  1010.0     MOHAN REDDY  19800.500000        NaT    Male      237606.00
5  1016.0  RAJENDRA KUMAR  22000.500000        NaT    Male      264006.00
6  1015.0    POOJA SHARMA  13200.000000 2011-02-05  Female      144000.00
7  1003.0    GAURAV GUPTA  17288.691538 2002-03-03    Male      216006.36
8  1009.0     PRIYA SINGH  17500.250000        NaT  Female      210003.00
9  1012.0      AMIT PATEL  18999.990000 2008-11-11    Male      227999.88

        Bonus Department
0  1000.00000    Systems
1  1450.07500    Systems
2  1181.25000    Systems
3  1237.53750    Systems
4  1980.05000    Systems
5  2200.05000    Systems
6   900.00000   Web Apps
7  1800.05300   Web Apps
8  1312.51875   Web Apps
9  1899.99900   Web Apps

<h3>22. Insert a new column "SALARY" which should be identical to the 'Sal' column.

In [86]:
df['SALARY'] = df['Sal']

print(df)

    Empid           Ename           Sal        Doj  Gender  Annual-Salary  \
0  1001.0      GANESH RAO  10000.000000 2000-10-10    Male      120000.00
1  1007.0    SURESH KUMAR  14500.750000        NaT    Male      174009.00
2  1013.0    SHWETA GUPTA  17325.000000        NaT  Female      189000.00
3  1004.0    HEMA CHANDRA  18150.550000 2000-10-09  Female      198006.00
4  1010.0     MOHAN REDDY  19800.500000        NaT    Male      237606.00
5  1016.0  RAJENDRA KUMAR  22000.500000        NaT    Male      264006.00
6  1015.0    POOJA SHARMA  13200.000000 2011-02-05  Female      144000.00
7  1003.0    GAURAV GUPTA  17288.691538 2002-03-03    Male      216006.36
8  1009.0     PRIYA SINGH  17500.250000        NaT  Female      210003.00
9  1012.0      AMIT PATEL  18999.990000 2008-11-11    Male      227999.88

        Bonus Department        SALARY
0  1000.00000    Systems  10000.000000
1  1450.07500    Systems  14500.750000
2  1181.25000    Systems  17325.000000
3  1237.53750    Systems  18150.550000
4  1980.05000    Systems  19800.500000
5  2200.05000    Systems  22000.500000
6   900.00000   Web Apps  13200.000000
7  1800.05300   Web Apps  17288.691538
8  1312.51875   Web Apps  17500.250000
9  1899.99900   Web Apps  18999.990000

<h3>23. Remove the 'SALARY' column.

In [87]:
df = df.drop(columns=['SALARY'])

print(df)

    Empid           Ename           Sal        Doj  Gender  Annual-Salary  \
0  1001.0      GANESH RAO  10000.000000 2000-10-10    Male      120000.00
1  1007.0    SURESH KUMAR  14500.750000        NaT    Male      174009.00
2  1013.0    SHWETA GUPTA  17325.000000        NaT  Female      189000.00
3  1004.0    HEMA CHANDRA  18150.550000 2000-10-09  Female      198006.00
4  1010.0     MOHAN REDDY  19800.500000        NaT    Male      237606.00
5  1016.0  RAJENDRA KUMAR  22000.500000        NaT    Male      264006.00
6  1015.0    POOJA SHARMA  13200.000000 2011-02-05  Female      144000.00
7  1003.0    GAURAV GUPTA  17288.691538 2002-03-03    Male      216006.36
8  1009.0     PRIYA SINGH  17500.250000        NaT  Female      210003.00
9  1012.0      AMIT PATEL  18999.990000 2008-11-11    Male      227999.88

        Bonus Department
0  1000.00000    Systems
1  1450.07500    Systems
2  1181.25000    Systems
3  1237.53750    Systems
4  1980.05000    Systems
5  2200.05000    Systems
6   900.00000   Web Apps
7  1800.05300   Web Apps
8  1312.51875   Web Apps
9  1899.99900   Web Apps